documentation/manual/src/doc/guides/custom-authentication.md
~~~ mermaid
sequenceDiagram
client->>server: GET /login
Note over client,server: Client sends its credentials (e.g. a password or an API key)
alt valid credentials
  server-->>client: Ok: JSON Web Token
  Note over client,server: Server replies with a JSON Web Token attached to its response
else invalid credentials
  server-->>client: Bad Request
end
client->>server: GET /protected-resource
Note over client,server: Client tries to access to a protected resource by using its JWT
alt valid JWT
  server-->>client: Ok
else invalid or missing JWT
  server-->>client: Unauthorized
end
~~~
