documentation/manual/src/doc/guides/custom-authentication.md
~~~ mermaid
graph BT

Authentication -- "« enrich »" --> algebra.Endpoints
AuthenticationEndpoints -- " « use » " --> Authentication
AuthenticationEndpoints -- " « use » " --> algebra.Endpoints

server.Endpoints -- "« implement »" --> algebra.Endpoints
ServerAuthentication -- "« implement »" --> Authentication
ServerAuthentication -- "« apply »" --> server.Endpoints

Server -- "« use »" --> AuthenticationEndpoints
Server -- "« apply »" --> ServerAuthentication
Server -- "« apply »" --> server.Endpoints

style algebra.Endpoints fill:#eee
style server.Endpoints fill:#eee
~~~
